Revit 2026 API

# WaterWaterColorByObject Property

---

The property labeled "Custom Color" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaterColorByObject { get; }
```
```vb
Public Shared ReadOnly Property WaterColorByObject As String
	Get
```
```cpp
public:
static property String^ WaterColorByObject {
	String^ get ();
}
```
```fsharp
static member WaterColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Water Class

Autodesk.Revit.DB.Visual Namespace